
choice = input("""შეკითხვა 1: აირჩიეთ 3 კარიდან ერთ-ერთი (1, 2 ან 3)
""")

if choice == "1":
    print ("თქვენ გადახვედით შემდეგ ეტაპზე. გილოცავთ!")
    choice = input("""შეკითხვა 2: თქვენ შეგხვდათ მდინარე, როგორ მოიქცევით? (აირჩიეთ 1 ან 2)
        1. გადავცურავ
        2. მოვძებნი ხიდს
    """)
    if choice == "1":
        print("თქვენ გაგიმართლად და უსაფრთხოდ გადაცურეთ მდინარე")
        choice = input("""შეკითხვა 3: თქვენ მიაღწიეთ ციხესიმაგრეს. რომელ კარიბჭეს აირჩევთ (A, B ან C)
        """).lower()
        if choice == "a":
            print("გილოცავთ, თქვენ წარამტებით დაასრულეთ თამაში")
        else:
            print("თქვენ აირჩიეთ არასწორი კარიბჭე. თამაში დასრულდა")
    else:
        print("ხიდი ჩატეხილია. თამაში დასრულდა")
     
elif choice == "2":
    print ("თქვენ ჩავარდით ორმოში. თამაში დასრულებულია!")

elif choice == "3":
    print ("თქვენ აღმოაჩინეთ ოქროს გასაღები და ხართ ამ თამაშის გამარჯვებული.")

else:
    print ("აირჩიეთ მოცემული 3 კარიდან ერთ-ერთი (1, 2 ან 3)")
